trade_exp/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1a4991f8-7832-4ca9-8809-88a97de88749">
  <name>ДокументыФизическихЛиц</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4f44c1c0-0480-415e-8058-41b28f2f43a0">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3b708ec7-6543-40ff-8ea2-16d4ddb7d56f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="433e502d-ab5c-4e8e-a7c0-0fde1aa6f767">
    <name>ДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6bd65f02-9531-4dd4-bd4a-4132aa3c4787">
    <name>СрокДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d9863e6-aab7-4808-a516-8bc42dae5d01">
    <name>КемВыдан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2910bb8-fdd2-480c-8ae2-78661d7d18e0">
    <name>КодПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="218302fa-674d-45e1-a7e2-2cce2d011342">
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="70264a0a-95c5-426f-a1bf-0f57b86d4030">
    <name>Представление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="cadcf4bd-2047-4fcb-b58e-bd6c09c5577a">
    <name>ФамилияЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e22a7536-dd59-4093-bfc8-335178b9da44">
    <name>ИмяЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="af40a979-1391-4411-b5a4-9f9a91fb8123">
    <name>СтранаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="365ca951-7fbf-4ad3-9004-47c3ef48b3bd">
    <name>КатегорииТранспортныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a231846e-d31a-4f94-9c9f-1e18d525af6c">
    <name>АдресПрописки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac3dc5c4-e172-49f9-b95f-4221e68f3600">
    <name>АдресПроживания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0495d913-3a33-41b9-9065-56d730c8fc56">
    <name>СовпадаетСПропиской</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="3291428e-6727-43cc-a1f8-c62f90320e90">
    <name>Физлицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d867720c-c937-4689-b241-0afda05ef993">
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДокументыФизическихЛиц/Forms/ФормаЗаписи/Module.bsl
//NZ Задача № 156838
 &НаКлиенте
Процедура Док_АдресПропискиПриИзмененииПосле(Элемент)	
	Элементы.СовпадаетСПропиской.Доступность = ЗначениеЗаполнено(Запись.АдресПрописки) ;
	Если Запись.СовпадаетСПропиской Тогда
		Запись.АдресПроживания = Запись.АдресПрописки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Док_СовпадаетСПропискойПриИзмененииПосле(Элемент)
	Запись.АдресПроживания = ?(Запись.СовпадаетСПропиской, Запись.АдресПрописки, "" );
КонецПроцедуры
